Catalogs/ИдентификаторыСтрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрок</Name>
			<Comment>Содержит связку текстовая строка - идентификатор этой строки как ГУИД элемента справочника</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПолнуюСтроку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицированнаяСтрока</Name>
					<Comment>Используется для поиска, не содержит пробелов, все символы в нижнем регистре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписываемыйОбъект</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнаяСтрока</Name>
					<Comment>В отиличие от наименования длина данной строки не ограничена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Comment>Признак группировки ответов на конкретный вопрос в отчетах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИдентификаторыСтрок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		Элементы.Наименование.Доступность	= Ложь;
		Элементы.ПолнаяСтрока.Доступность	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ПолнаяСтрока) Тогда
		ТекущийОбъект.ПолнаяСтрока = ТекущийОбъект.Наименование;
	КонецЕсли;
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ТекущийОбъект.Наименование);
		
		Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
			Сообщить("Нулевая длина модифицироанной строки");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИдентификаторыСтрок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
		|ГДЕ
		|	ИдентификаторыСтрок.МодифицированнаяСтрока ПОДОБНО &Наименование";	
		Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);	
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Сообщить("Такой элемент уже существует!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ТекущийОбъект.МодифицированнаяСтрока = МодифицированнаяСтрока;
	КонецЕсли;
КонецПроцедуры
